Тестовая_база_ERP_14/src/Enums/bpmТипыДействий/bpmТипыДействий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>bpmТипыДействий</name>
  <enumValues>
    <name>ВводДокумента</name>
  </enumValues>
  <enumValues>
    <name>Оповещение</name>
  </enumValues>
  <enumValues>
    <name>ОповещениеСМС</name>
  </enumValues>
  <enumValues>
    <name>ПроверкаУсловия</name>
  </enumValues>
</mdclass:Enum>

Тестовая_база_ERP_14/src/Enums/bpmСобытияЭтапа/bpmСобытияЭтапа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>bpmСобытияЭтапа</name>
  <enumValues>
    <name>ПриПринятииКИсполнению</name>
  </enumValues>
  <enumValues>
    <name>ПриЗавершении</name>
  </enumValues>
  <enumValues>
    <name>ПриСозданииЗадачи</name>
  </enumValues>
</mdclass:Enum>

Тестовая_база_ERP_14/src/Enums/bpmТипыДействий/ManagerModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	Если Параметры.Свойство("Событие") Тогда
		Если Параметры.Событие = Перечисления.bpmСобытияЭтапа.ПриПринятииКИсполнению Тогда
			СтандартнаяОбработка = Ложь;
			СписокДляВыбора = Новый СписокЗначений;
			СписокДляВыбора.Добавить(Перечисления.bpmТипыДействий.Оповещение);
			СписокДляВыбора.Добавить(Перечисления.bpmТипыДействий.ОповещениеСМС);
			СписокДляВыбора.Добавить(Перечисления.bpmТипыДействий.ПроверкаУсловия);
			ДанныеВыбора = СписокДляВыбора;
		ИначеЕсли Параметры.Событие = Перечисления.bpmСобытияЭтапа.ПриСозданииЗадачи Тогда
			СтандартнаяОбработка = Ложь;
			СписокДляВыбора = Новый СписокЗначений;
			СписокДляВыбора.Добавить(Перечисления.bpmТипыДействий.Оповещение);
			СписокДляВыбора.Добавить(Перечисления.bpmТипыДействий.ОповещениеСМС);
			ДанныеВыбора = СписокДляВыбора;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
